{
    "0": "\"PAD\"",
    "1": "\"SOS\"",
    "2": "\"EOS\"",
    "3": "!",
    "4": "\"",
    "5": "#",
    "6": "&",
    "7": "'",
    "8": "(",
    "9": ")",
    "10": "*",
    "11": "+",
    "12": ",",
    "13": "-",
    "14": "--",
    "15": "---",
    "16": ".",
    "17": "/",
    "18": "0",
    "19": "0.25",
    "20": "0.4",
    "21": "0.5",
    "22": "1",
    "23": "14",
    "24": "2",
    "25": "3",
    "26": "4",
    "27": "5",
    "28": "6",
    "29": "7",
    "30": "8",
    "31": "9",
    "32": ":",
    "33": ";",
    "34": "<",
    "35": "=",
    "36": ">",
    "37": "?",
    "38": "@",
    "39": "A",
    "40": "B",
    "41": "C",
    "42": "D",
    "43": "E",
    "44": "F",
    "45": "G",
    "46": "H",
    "47": "I",
    "48": "J",
    "49": "K",
    "50": "L",
    "51": "M",
    "52": "N",
    "53": "O",
    "54": "P",
    "55": "Q",
    "56": "R",
    "57": "S",
    "58": "T",
    "59": "U",
    "60": "V",
    "61": "W",
    "62": "X",
    "63": "Y",
    "64": "Z",
    "65": "[",
    "66": "\\",
    "67": "\\!",
    "68": "\\#",
    "69": "\\&",
    "70": "\\'",
    "71": "\\*",
    "72": "\\,",
    "73": "\\-",
    "74": "\\/",
    "75": "\\:",
    "76": "\\;",
    "77": "\\AA",
    "78": "\\Arrowvert",
    "79": "\\Bar",
    "80": "\\Big",
    "81": "\\Bigg",
    "82": "\\Biggl",
    "83": "\\Biggm",
    "84": "\\Biggr",
    "85": "\\Bigl",
    "86": "\\Bigm",
    "87": "\\Bigr",
    "88": "\\Box",
    "89": "\\Delta",
    "90": "\\Diamond",
    "91": "\\Downarrow",
    "92": "\\Gamma",
    "93": "\\Hat",
    "94": "\\Huge",
    "95": "\\Im",
    "96": "\\L",
    "97": "\\LARGE",
    "98": "\\Lambda",
    "99": "\\Large",
    "100": "\\Leftarrow",
    "101": "\\Leftrightarrow",
    "102": "\\Longleftarrow",
    "103": "\\Longleftrightarrow",
    "104": "\\Longrightarrow",
    "105": "\\O",
    "106": "\\Omega",
    "107": "\\P",
    "108": "\\Phi",
    "109": "\\Pi",
    "110": "\\Psi",
    "111": "\\Re",
    "112": "\\Rightarrow",
    "113": "\\Rrightarrow",
    "114": "\\S",
    "115": "\\SS",
    "116": "\\Sigma",
    "117": "\\Theta",
    "118": "\\Tilde",
    "119": "\\Uparrow",
    "120": "\\Upsilon",
    "121": "\\Vdash",
    "122": "\\Vec",
    "123": "\\Vert",
    "124": "\\Xi",
    "125": "\\[",
    "126": "\\\\",
    "127": "\\]",
    "128": "\\^",
    "129": "\\_",
    "130": "\\a",
    "131": "\\acute",
    "132": "\\ae",
    "133": "\\aleph",
    "134": "\\allowbreak",
    "135": "\\alpha",
    "136": "\\amalg",
    "137": "\\angle",
    "138": "\\approx",
    "139": "\\approxeq",
    "140": "\\arcsin",
    "141": "\\arctan",
    "142": "\\arg",
    "143": "\\arraycolsep",
    "144": "\\arraystretch",
    "145": "\\arrowvert",
    "146": "\\ast",
    "147": "\\asymp",
    "148": "\\atop",
    "149": "\\atopwithdelims",
    "150": "\\b",
    "151": "\\backsimeq",
    "152": "\\backslash",
    "153": "\\bar",
    "154": "\\barwedge",
    "155": "\\begin{array}",
    "156": "\\beta",
    "157": "\\beth",
    "158": "\\bf",
    "159": "\\big",
    "160": "\\bigcap",
    "161": "\\bigcirc",
    "162": "\\bigcup",
    "163": "\\bigg",
    "164": "\\biggl",
    "165": "\\biggm",
    "166": "\\biggr",
    "167": "\\bigl",
    "168": "\\bigm",
    "169": "\\bigodot",
    "170": "\\bigoplus",
    "171": "\\bigotimes",
    "172": "\\bigr",
    "173": "\\bigsqcup",
    "174": "\\bigstar",
    "175": "\\bigtriangledown",
    "176": "\\bigtriangleup",
    "177": "\\biguplus",
    "178": "\\bigvee",
    "179": "\\bigwedge",
    "180": "\\binom",
    "181": "\\blacksquare",
    "182": "\\bmod",
    "183": "\\boldmath",
    "184": "\\boldsymbol",
    "185": "\\bot",
    "186": "\\bowtie",
    "187": "\\boxed",
    "188": "\\boxtimes",
    "189": "\\brace",
    "190": "\\brack",
    "191": "\\breve",
    "192": "\\bullet",
    "193": "\\bumpeq",
    "194": "\\c",
    "195": "\\cal",
    "196": "\\cancel",
    "197": "\\cap",
    "198": "\\cdot",
    "199": "\\cdotp",
    "200": "\\cdots",
    "201": "\\ce",
    "202": "\\cfrac",
    "203": "\\check",
    "204": "\\chi",
    "205": "\\circ",
    "206": "\\circledcirc",
    "207": "\\cite",
    "208": "\\colon",
    "209": "\\complement",
    "210": "\\cong",
    "211": "\\coprod",
    "212": "\\cos",
    "213": "\\cosh",
    "214": "\\cot",
    "215": "\\coth",
    "216": "\\csc",
    "217": "\\cup",
    "218": "\\curvearrowright",
    "219": "\\d",
    "220": "\\dag",
    "221": "\\dagger",
    "222": "\\ddag",
    "223": "\\ddagger",
    "224": "\\dddot",
    "225": "\\ddot",
    "226": "\\ddots",
    "227": "\\def",
    "228": "\\deg",
    "229": "\\delta",
    "230": "\\diagup",
    "231": "\\diamond",
    "232": "\\diamondsuit",
    "233": "\\digamma",
    "234": "\\dim",
    "235": "\\displaystyle",
    "236": "\\div",
    "237": "\\do",
    "238": "\\dot",
    "239": "\\doteq",
    "240": "\\dots",
    "241": "\\dotsb",
    "242": "\\dotsc",
    "243": "\\dotsi",
    "244": "\\dotsm",
    "245": "\\doublebarwedge",
    "246": "\\downarrow",
    "247": "\\ell",
    "248": "\\emptyset",
    "249": "\\end{array}",
    "250": "\\enskip",
    "251": "\\enspace",
    "252": "\\ensuremath",
    "253": "\\epsilon",
    "254": "\\eqno",
    "255": "\\equiv",
    "256": "\\eta",
    "257": "\\everymath",
    "258": "\\exists",
    "259": "\\exp",
    "260": "\\expandafter",
    "261": "\\fbox",
    "262": "\\fill",
    "263": "\\flat",
    "264": "\\footnote",
    "265": "\\footnotemark",
    "266": "\\footnotesize",
    "267": "\\forall",
    "268": "\\frac",
    "269": "\\framebox",
    "270": "\\frown",
    "271": "\\gamma",
    "272": "\\ge",
    "273": "\\geq",
    "274": "\\geqslant",
    "275": "\\gets",
    "276": "\\gg",
    "277": "\\gimel",
    "278": "\\grave",
    "279": "\\gtrapprox",
    "280": "\\gtrsim",
    "281": "\\hat",
    "282": "\\hbar",
    "283": "\\hfil",
    "284": "\\hfill",
    "285": "\\hline",
    "286": "\\hom",
    "287": "\\hookrightarrow",
    "288": "\\hphantom",
    "289": "\\hskip",
    "290": "\\hspace",
    "291": "\\hss",
    "292": "\\huge",
    "293": "\\i",
    "294": "\\iff",
    "295": "\\iiint",
    "296": "\\iint",
    "297": "\\ij",
    "298": "\\imath",
    "299": "\\implies",
    "300": "\\in",
    "301": "\\index",
    "302": "\\infty",
    "303": "\\int",
    "304": "\\intercal",
    "305": "\\intop",
    "306": "\\iota",
    "307": "\\it",
    "308": "\\j",
    "309": "\\jmath",
    "310": "\\joinrel",
    "311": "\\kappa",
    "312": "\\ker",
    "313": "\\kern",
    "314": "\\l",
    "315": "\\lVert",
    "316": "\\lambda",
    "317": "\\land",
    "318": "\\langle",
    "319": "\\large",
    "320": "\\lbrace",
    "321": "\\lbrack",
    "322": "\\lceil",
    "323": "\\ldots",
    "324": "\\le",
    "325": "\\left(",
    "326": "\\left)",
    "327": "\\left.",
    "328": "\\left/",
    "329": "\\left<",
    "330": "\\left>",
    "331": "\\left[",
    "332": "\\left\\Vert",
    "333": "\\left\\langle",
    "334": "\\left\\lbrace",
    "335": "\\left\\lbrack",
    "336": "\\left\\lceil",
    "337": "\\left\\lfloor",
    "338": "\\left\\vert",
    "339": "\\left\\{",
    "340": "\\left\\|",
    "341": "\\left]",
    "342": "\\leftarrow",
    "343": "\\lefteqn",
    "344": "\\leftrightarrow",
    "345": "\\leftrightarrows",
    "346": "\\leftrightharpoons",
    "347": "\\left|",
    "348": "\\leq",
    "349": "\\leqq",
    "350": "\\leqslant",
    "351": "\\lesssim",
    "352": "\\lfloor",
    "353": "\\lg",
    "354": "\\lgroup",
    "355": "\\ll",
    "356": "\\llap",
    "357": "\\llcorner",
    "358": "\\ln",
    "359": "\\lnot",
    "360": "\\log",
    "361": "\\longleftarrow",
    "362": "\\longleftrightarrow",
    "363": "\\longmapsto",
    "364": "\\longrightarrow",
    "365": "\\lor",
    "366": "\\lq",
    "367": "\\lrcorner",
    "368": "\\ltimes",
    "369": "\\makebox",
    "370": "\\mapsto",
    "371": "\\mathbb",
    "372": "\\mathbf",
    "373": "\\mathbin",
    "374": "\\mathcal",
    "375": "\\mathchoice",
    "376": "\\mathclose",
    "377": "\\mathfrak",
    "378": "\\mathit",
    "379": "\\mathnormal",
    "380": "\\mathop",
    "381": "\\mathopen",
    "382": "\\mathord",
    "383": "\\mathrel",
    "384": "\\mathrm",
    "385": "\\mathsf",
    "386": "\\mathstrut",
    "387": "\\mathtt",
    "388": "\\medskip",
    "389": "\\mid",
    "390": "\\mit",
    "391": "\\mod",
    "392": "\\models",
    "393": "\\mp",
    "394": "\\mu",
    "395": "\\nRightarrow",
    "396": "\\nVdash",
    "397": "\\nabla",
    "398": "\\natural",
    "399": "\\ne",
    "400": "\\nearrow",
    "401": "\\neg",
    "402": "\\negthickspace",
    "403": "\\neq",
    "404": "\\newline",
    "405": "\\ngeq",
    "406": "\\ni",
    "407": "\\nleftarrow",
    "408": "\\nleftrightarrow",
    "409": "\\nleq",
    "410": "\\nmid",
    "411": "\\noindent",
    "412": "\\nonumber",
    "413": "\\normalsize",
    "414": "\\not",
    "415": "\\notag",
    "416": "\\notin",
    "417": "\\nrightarrow",
    "418": "\\nu",
    "419": "\\null",
    "420": "\\nulldelimiterspace",
    "421": "\\nwarrow",
    "422": "\\o",
    "423": "\\odot",
    "424": "\\of",
    "425": "\\offinterlineskip",
    "426": "\\oint",
    "427": "\\ointop",
    "428": "\\omega",
    "429": "\\ominus",
    "430": "\\operatorname",
    "431": "\\operatorname*",
    "432": "\\oplus",
    "433": "\\oslash",
    "434": "\\otimes",
    "435": "\\overbrace",
    "436": "\\overleftarrow",
    "437": "\\overleftrightarrow",
    "438": "\\overline",
    "439": "\\overrightarrow",
    "440": "\\overset",
    "441": "\\overwithdelims",
    "442": "\\owns",
    "443": "\\parallel",
    "444": "\\partial",
    "445": "\\perp",
    "446": "\\phantom",
    "447": "\\phi",
    "448": "\\pi",
    "449": "\\pitchfork",
    "450": "\\pm",
    "451": "\\pmb",
    "452": "\\pmod",
    "453": "\\pounds",
    "454": "\\prec",
    "455": "\\preccurlyeq",
    "456": "\\preceq",
    "457": "\\prime",
    "458": "\\prod",
    "459": "\\propto",
    "460": "\\protect",
    "461": "\\psi",
    "462": "\\qquad",
    "463": "\\quad",
    "464": "\\rVert",
    "465": "\\rangle",
    "466": "\\rbrace",
    "467": "\\rbrack",
    "468": "\\rceil",
    "469": "\\ref",
    "470": "\\relax",
    "471": "\\rfloor",
    "472": "\\rgroup",
    "473": "\\rho",
    "474": "\\right(",
    "475": "\\right)",
    "476": "\\right.",
    "477": "\\right/",
    "478": "\\right<",
    "479": "\\right>",
    "480": "\\right[",
    "481": "\\right\\Vert",
    "482": "\\right\\rangle",
    "483": "\\right\\rbrace",
    "484": "\\right\\rbrack",
    "485": "\\right\\rceil",
    "486": "\\right\\rfloor",
    "487": "\\right\\vert",
    "488": "\\right\\|",
    "489": "\\right\\}",
    "490": "\\right]",
    "491": "\\rightarrow",
    "492": "\\rightharpoondown",
    "493": "\\rightharpoonup",
    "494": "\\rightleftarrows",
    "495": "\\rightleftharpoons",
    "496": "\\rightrightarrows",
    "497": "\\rightsquigarrow",
    "498": "\\right|",
    "499": "\\rlap",
    "500": "\\romannumeral",
    "501": "\\root",
    "502": "\\rtimes",
    "503": "\\rule",
    "504": "\\sb",
    "505": "\\sc",
    "506": "\\scriptscriptstyle",
    "507": "\\scriptsize",
    "508": "\\scriptstyle",
    "509": "\\scshape",
    "510": "\\searrow",
    "511": "\\sec",
    "512": "\\setminus",
    "513": "\\sf",
    "514": "\\sharp",
    "515": "\\shortmid",
    "516": "\\sideset",
    "517": "\\sigma",
    "518": "\\sim",
    "519": "\\simeq",
    "520": "\\sin",
    "521": "\\sinh",
    "522": "\\skew",
    "523": "\\sl",
    "524": "\\slash",
    "525": "\\small",
    "526": "\\smallint",
    "527": "\\smallsetminus",
    "528": "\\smallskip",
    "529": "\\smash",
    "530": "\\smile",
    "531": "\\sp",
    "532": "\\space",
    "533": "\\special",
    "534": "\\sqcap",
    "535": "\\sqcup",
    "536": "\\sqrt",
    "537": "\\sqsubseteq",
    "538": "\\square",
    "539": "\\ss",
    "540": "\\stackrel",
    "541": "\\star",
    "542": "\\strut",
    "543": "\\subset",
    "544": "\\subseteq",
    "545": "\\subsetneq",
    "546": "\\subsetneqq",
    "547": "\\substack",
    "548": "\\succ",
    "549": "\\succeq",
    "550": "\\sum",
    "551": "\\supset",
    "552": "\\supseteq",
    "553": "\\supsetneq",
    "554": "\\surd",
    "555": "\\swarrow",
    "556": "\\symbol",
    "557": "\\tag",
    "558": "\\tan",
    "559": "\\tau",
    "560": "\\textbf",
    "561": "\\textcircled",
    "562": "\\textit",
    "563": "\\textmd",
    "564": "\\textnormal",
    "565": "\\textrm",
    "566": "\\textsc",
    "567": "\\textsf",
    "568": "\\textsl",
    "569": "\\textstyle",
    "570": "\\texttt",
    "571": "\\textup",
    "572": "\\therefore",
    "573": "\\theta",
    "574": "\\thickapprox",
    "575": "\\thicksim",
    "576": "\\thinspace",
    "577": "\\tilde",
    "578": "\\times",
    "579": "\\tiny",
    "580": "\\to",
    "581": "\\top",
    "582": "\\triangle",
    "583": "\\triangleleft",
    "584": "\\trianglelefteq",
    "585": "\\triangleq",
    "586": "\\triangleright",
    "587": "\\tt",
    "588": "\\twoheadrightarrow",
    "589": "\\ule",
    "590": "\\underbar",
    "591": "\\underbrace",
    "592": "\\underline",
    "593": "\\underrightarrow",
    "594": "\\underset",
    "595": "\\uparrow",
    "596": "\\updownarrow",
    "597": "\\upharpoonright",
    "598": "\\uplus",
    "599": "\\uppercase",
    "600": "\\upsilon",
    "601": "\\vDash",
    "602": "\\varDelta",
    "603": "\\varGamma",
    "604": "\\varOmega",
    "605": "\\varUpsilon",
    "606": "\\varepsilon",
    "607": "\\varinjlim",
    "608": "\\varkappa",
    "609": "\\varliminf",
    "610": "\\varlimsup",
    "611": "\\varnothing",
    "612": "\\varphi",
    "613": "\\varpi",
    "614": "\\varprojlim",
    "615": "\\varpropto",
    "616": "\\varrho",
    "617": "\\varsigma",
    "618": "\\vartheta",
    "619": "\\vartriangle",
    "620": "\\vdash",
    "621": "\\vdots",
    "622": "\\vec",
    "623": "\\vee",
    "624": "\\veebar",
    "625": "\\verb",
    "626": "\\vert",
    "627": "\\vline",
    "628": "\\vphantom",
    "629": "\\vrule",
    "630": "\\wedge",
    "631": "\\widehat",
    "632": "\\widetilde",
    "633": "\\wp",
    "634": "\\wr",
    "635": "\\xi",
    "636": "\\xleftarrow",
    "637": "\\xrightarrow",
    "638": "\\zeta",
    "639": "\\{",
    "640": "\\|",
    "641": "\\}",
    "642": "]",
    "643": "^",
    "644": "_",
    "645": "`",
    "646": "a",
    "647": "b",
    "648": "c",
    "649": "cm",
    "650": "d",
    "651": "e",
    "652": "ex",
    "653": "f",
    "654": "g",
    "655": "h",
    "656": "i",
    "657": "in",
    "658": "j",
    "659": "k",
    "660": "l",
    "661": "m",
    "662": "mm",
    "663": "n",
    "664": "o",
    "665": "p",
    "666": "pt",
    "667": "q",
    "668": "r",
    "669": "s",
    "670": "t",
    "671": "u",
    "672": "v",
    "673": "w",
    "674": "x",
    "675": "y",
    "676": "z",
    "677": "{",
    "678": "|",
    "679": "}",
    "680": "~",
    "681": "е",
    "682": "л",
    "683": "в",
    "684": "и",
    "685": "о",
    "686": "г",
    "687": "д",
    "688": "р",
    "689": "с",
    "690": "у"
}